Revit 2026 API

# UIFabricationUtils Class

---

General Fabrication UI utility methods in Revit UI.

SystemObject Autodesk.Revit.UIUIFabricationUtils

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class UIFabricationUtils
```
```vb
Public NotInheritable Class UIFabricationUtils
```
```cpp
public ref class UIFabricationUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UIFabricationUtils = class end
```

The UIFabricationUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetOpenConnectorIndicatorAwayColor | Gets the color of the open connector indicator in away direction. |
|  | GetOpenConnectorIndicatorPlanColor | Gets the color of the open connector indicator in plan view. |
|  | GetOpenConnectorIndicatorTowardsColor | Gets the color of the open connector indicator in towards direction. |
|  | SetOpenConnectorIndicatorAwayColor | Sets the color of the open connector indicator in away direction |
|  | SetOpenConnectorIndicatorPlanColor | Sets the color of the open connector indicator in plan view. |
|  | SetOpenConnectorIndicatorTowardsColor | Sets the color of the open connector indicator in towards direction |

#### Reference

Autodesk.Revit.UI Namespace